RevolutionLighting/RPDG_Hardware/SRC/SmartHigh/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t OPEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_OPEN_GPIO, BOARD_INITPINS_OPEN_PIN, &OPEN_config);

    gpio_pin_config_t TP9_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_TP9_GPIO, BOARD_INITPINS_TP9_PIN, &TP9_config);

    gpio_pin_config_t TP7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 23)  */
    GPIO_PinInit(BOARD_INITPINS_TP7_GPIO, BOARD_INITPINS_TP7_PIN, &TP7_config);

    gpio_pin_config_t TP6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 25)  */
    GPIO_PinInit(BOARD_INITPINS_TP6_GPIO, BOARD_INITPINS_TP6_PIN, &TP6_config);

    gpio_pin_config_t TP5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_TP5_GPIO, BOARD_INITPINS_TP5_PIN, &TP5_config);

    /* PORTA0 (pin 12) is configured as SWD_CLK */
    PORT_SetPinMux(BOARD_INITPINS_SWD_CLK_PORT, BOARD_INITPINS_SWD_CLK_PIN, kPORT_MuxAlt7);

    /* PORTA1 (pin 13) is configured as FTM2_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_CH4_DIM_PORT, BOARD_INITPINS_CH4_DIM_PIN, kPORT_MuxAlt3);

    /* PORTA18 (pin 17) is configured as EXTAL0 */
    PORT_SetPinMux(BOARD_INITPINS_EXTAL_PORT, BOARD_INITPINS_EXTAL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin 18) is configured as XTAL0 */
    PORT_SetPinMux(BOARD_INITPINS_XTAL_PORT, BOARD_INITPINS_XTAL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA2 (pin 14) is configured as FTM2_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_CH5_DIM_PORT, BOARD_INITPINS_CH5_DIM_PIN, kPORT_MuxAlt3);

    /* PORTA20 (pin 19) is configured as RESET_b */
    PORT_SetPinMux(BOARD_INITPINS_RESET_PORT, BOARD_INITPINS_RESET_PIN, kPORT_MuxAlt7);

    /* PORTA3 (pin 15) is configured as SWD_DIO */
    PORT_SetPinMux(BOARD_INITPINS_SWD_DIO_PORT, BOARD_INITPINS_SWD_DIO_PIN, kPORT_MuxAlt7);

    /* PORTA4 (pin 16) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_OPEN_PORT, BOARD_INITPINS_OPEN_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 20) is configured as FTM1_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_CH6_DIM_PORT, BOARD_INITPINS_CH6_DIM_PIN, kPORT_MuxAlt3);

    /* PORTB1 (pin 21) is configured as FTM1_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_CH7_DIM_PORT, BOARD_INITPINS_CH7_DIM_PIN, kPORT_MuxAlt3);

    /* PORTC1 (pin 22) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_TP9_PORT, BOARD_INITPINS_TP9_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 23) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_TP7_PORT, BOARD_INITPINS_TP7_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 24) is configured as FTM0_CH2 */
    PORT_SetPinMux(BOARD_INITPINS_CH8_DIM_PORT, BOARD_INITPINS_CH8_DIM_PIN, kPORT_MuxAlt4);

    /* PORTC4 (pin 25) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_TP6_PORT, BOARD_INITPINS_TP6_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 26) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_TP5_PORT, BOARD_INITPINS_TP5_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 27) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_UART_RX_PORT, BOARD_INITPINS_UART_RX_PIN, kPORT_MuxAlt5);

    /* PORTC7 (pin 28) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_UART_TX_PORT, BOARD_INITPINS_UART_TX_PIN, kPORT_MuxAlt5);

    /* PORTD4 (pin 29) is configured as FTM0_CH4 */
    PORT_SetPinMux(BOARD_INITPINS_CH9_DIM_PORT, BOARD_INITPINS_CH9_DIM_PIN, kPORT_MuxAlt4);

    /* PORTD5 (pin 30) is configured as FTM0_CH5 */
    PORT_SetPinMux(BOARD_INITPINS_CH10_DIM_PORT, BOARD_INITPINS_CH10_DIM_PIN, kPORT_MuxAlt4);

    /* PORTD6 (pin 31) is configured as FTM4_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_CH11_DIM_PORT, BOARD_INITPINS_CH11_DIM_PIN, kPORT_MuxAlt2);

    /* PORTD7 (pin 32) is configured as FTM4_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_CH12_DIM_PORT, BOARD_INITPINS_CH12_DIM_PIN, kPORT_MuxAlt2);

    /* PORTE16 (pin 3) is configured as PTE16 */
    PORT_SetPinMux(BOARD_INITPINS_TP2_PORT, BOARD_INITPINS_TP2_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[16] = ((PORTE->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTE17 (pin 4) is configured as PTE17 */
    PORT_SetPinMux(BOARD_INITPINS_TP3_PORT, BOARD_INITPINS_TP3_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[17] = ((PORTE->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTE18 (pin 5) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_SDA_PORT, BOARD_INITPINS_SDA_PIN, kPORT_MuxAlt4);

