RevolutionLighting/RPDG_Hardware/SRC/SmartHigh/board/pin_mux.c
    PORTE->PCR[18] = ((PORTE->PCR[18] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                      /* Slew Rate Enable: Fast slew rate is configured on the corresponding pin, if the pin is
                       * configured as a digital output. */
                      | PORT_PCR_SRE(kPORT_FastSlewRate));

    /* PORTE19 (pin 6) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_SCL_PORT, BOARD_INITPINS_SCL_PIN, kPORT_MuxAlt4);

    /* PORTE24 (pin 10) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_CH2_DIM_PORT, BOARD_INITPINS_CH2_DIM_PIN, kPORT_MuxAlt3);

    /* PORTE25 (pin 11) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_CH3_DIM_PORT, BOARD_INITPINS_CH3_DIM_PIN, kPORT_MuxAlt3);

    /* PORTE30 (pin 9) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_INITPINS_CH1_DIM_PORT, BOARD_INITPINS_CH1_DIM_PIN, kPORT_MuxAlt3);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK)))

                  /* UART 0 Transmit Data Source Select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

                  /* UART 0 Receive Data Source Select: UART0_RX pin. */
                  | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX));

    SIM->SOPT8 =
        ((SIM->SOPT8 &
          /* Mask bits to zero which are setting */
          (~(SIM_SOPT8_FTM0OCH0SRC_MASK | SIM_SOPT8_FTM0OCH1SRC_MASK | SIM_SOPT8_FTM0OCH2SRC_MASK | SIM_SOPT8_FTM0OCH3SRC_MASK | SIM_SOPT8_FTM0OCH4SRC_MASK | SIM_SOPT8_FTM0OCH5SRC_MASK | SIM_SOPT8_FTM2OCH0SRC_MASK | SIM_SOPT8_FTM2OCH1SRC_MASK)))

         /* FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH0SRC(SOPT8_FTM0OCH0SRC_NO_MODULATION)

         /* FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH1SRC(SOPT8_FTM0OCH1SRC_NO_MODULATION)

         /* FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH2SRC(SOPT8_FTM0OCH2SRC_NO_MODULATION)

         /* FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH3SRC(SOPT8_FTM0OCH3SRC_NO_MODULATION)

         /* FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH4SRC(SOPT8_FTM0OCH4SRC_NO_MODULATION)

         /* FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5
          * PWM/OCMP. */
         | SIM_SOPT8_FTM0OCH5SRC(SOPT8_FTM0OCH5SRC_NO_MODULATION)

         /* FTM2 channel 0 output PWM/OCMP mode source select: FTM2CH0 pin is the output of FTM2 channel 0
          * PWM/OCMP. */
         | SIM_SOPT8_FTM2OCH0SRC(SOPT8_FTM2OCH0SRC_NO_MODULATION)

         /* FTM2 channel 1 output PWM/OCMP mode source select: FTM2CH1 pin is the output of FTM2 channel 1
          * PWM/OCMP. */
         | SIM_SOPT8_FTM2OCH1SRC(SOPT8_FTM2OCH1SRC_NO_MODULATION));

    SIM->SOPT9 = ((SIM->SOPT9 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT9_FTM4OCH0SRC_MASK | SIM_SOPT9_FTM4OCH1SRC_MASK)))

                  /* FTM4 channel 0 output PWM/OCMP mode source select: FTM4CH0 pin is the output of FTM4 channel
                   * 0 PWM/OCMP. */
                  | SIM_SOPT9_FTM4OCH0SRC(SOPT9_FTM4OCH0SRC_NO_MODULATION)

                  /* FTM4 channel 1 output PWM/OCMP mode source select: FTM4CH1 pin is the output of FTM4 channel
                   * 1 PWM/OCMP. */
                  | SIM_SOPT9_FTM4OCH1SRC(SOPT9_FTM4OCH1SRC_NO_MODULATION));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
